def det(A):
    return A[0][0]*A[1][1] - A[0][1]*A[1][0]


#print("=== РЕШЕНИЕ СИСТЕМЫ ЛИНЕЙНЫХ УРАВНЕНИЙ С ДВУМЯ НЕИЗВЕСТНЫМИ ===")
#print("========================= Ax + By = C =========================")

#line_1 = [float(x) for x in input("Введите коэффициенты первого уравнения через пробел: ").split()]
#line_2 = [float(x) for x in input("Введите коэффициенты второго уравнения через пробел: ").split()]



def f(line_1, line_2):

    A = [line_1[:-1], line_2[:-1]]
    X = [[line_1[2], line_1[1]], [line_2[2], line_2[1]]]
    Y = [[line_1[0], line_1[2]], [line_2[0], line_2[2]]]

    x = det(X)/det(A)
    y = det(Y)/det(A)

    return (x, y)

m1 = 1.136
m2 = 0.966
T1 = 20.0 + 273.2
T2 = 40.0 + 273.2

R = 8.31
C = 37.1

# x = a, y = b

(x, y) = f([2/R/T1, -1, m1*C], [2/R/T2, -1, m2*C])

print(x, y)
